package KI301.Demchuk.lab3;

/**
 * Інтерфейс `CargoTransport` визначає методи, які повинні бути реалізовані
 * в класах, які представляють вантажний транспорт.
 */
public interface CargoTransport {
    /**
     * Завантажує вантаж на транспортний засіб.
     *
     * @param weight Вага завантаженого вантажу (у кілограмах).
     */
    void loadCargo(double weight);

    /**
     * Розвантажує вантаж з транспортного засобу.
     */
    void unloadCargo();

    /**
     * Повертає вагу завантаженого вантажу на транспортному засобі.
     *
     * @return Вага завантаженого вантажу (у кілограмах).
     */
    double getCargoWeight();
}
