package KI301.Demchuk.lab3;
/**
 * Інтерфейс `Trailer` визначає методи, які повинні бути реалізовані
 * в класах, які можуть мати причіп (трейлер).
 */
public interface Trailer {
    /**
     * Приєднує причіп (трейлер) до транспортного засобу.
     */
    void attachTrailer();

    /**
     * Від'єднує причіп (трейлер) від транспортного засобу.
     */
    void detachTrailer();

    /**
     * Перевіряє, чи є причіп (трейлер) приєднаним до транспортного засобу.
     *
     * @return True, якщо є причіп (трейлер), false - у протилежному випадку.
     */
    boolean hasTrailer();
}
